app/views/questionnaires/index.html.haml

          = questionnaire.title
        = "Questions: " + questionnaire.questions.count.to_s
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."questionnaire_id" = $1  [["questionnaire_id", 1]]