app/views/questionnaires/show.html.haml

      %div.questions
        - @questionnaire.questions.each do |question|
---
SELECT "questions".* FROM "questions" WHERE "questions"."questionnaire_id" = 1