app/controllers/games_controller.rb

SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
  	username  = params[:username]
  	questionnaire = Questionnaire.find_by(:id => params[:questionnaire_id])

SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."questionnaire_id" = $1  [["questionnaire_id", 1]]
---
  def show
    @questionnaire = Questionnaire.find_by(:id => params[:questionnaire_id])
    if !@questionnaire.nil?
      @question_number = params[:question_id].to_i
      @question = @questionnaire.questions[@question_number - 1]
      @question_count = @questionnaire.questions.count

SELECT "questionnaires".* FROM "questionnaires"
---
  def index
    @questionnaires = Questionnaire.all

SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."questionnaire_id" = $1 AND (questions.id ='1') ORDER BY "questions"."id" ASC LIMIT $2  [["questionnaire_id", 1], ["LIMIT", 1]]
---
  def get_answer
    questionnaire_id = params[:questionnaire_id]
    question_id      = params[:question_id]
    answer_value     = params[:answer]

    @result          = false

    questionnaire    = Questionnaire.find_by(:id => questionnaire_id)
    question         = Question.where("id =? and questionnaire_id =?", question_id, questionnaire.id).first