app/controllers/questionnaires_controller.rb

INSERT INTO "questionnaires" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Hola"], ["created_at", 2016-06-10 23:37:08 UTC], ["updated_at", 2016-06-10 23:37:08 UTC]]
INSERT INTO "questions" ("content", "answer", "questionnaire_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hola"], ["answer", "hola"], ["questionnaire_id", 1], ["created_at", 2016-06-10 23:37:08 UTC], ["updated_at", 2016-06-10 23:37:08 UTC]]
---
  def create
    @questionnaire   = Questionnaire.new(questionnaire_params)
    if @questionnaire.save

SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."questionnaire_id" = 1
---
  def show
    @questionnaire   = Questionnaire.includes(:questions).find_by(:id => params[:id])

SELECT "questionnaires".* FROM "questionnaires"
---
  def index
    @questionnaires  = Questionnaire.all

SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "questionnaires" WHERE "questionnaires"."id" = $1  [["id", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]
---
  def destroy
    @questionnaire   = Questionnaire.find_by(:id => params[:id])
    @questionnaire.destroy